Added diagram, db doc must be updated!
